Repository: MOUSAHLP/farmy_client_flutter
Catalog: lib/l10n/app_*.arb
Languages: ar

# new_subscription
source: Sign up
ar: انشاء حساب

source: Sign in
ar: تسجيل دخول

# login_guest
source: Continue as a guest
ar: الدخول كضيف

source: Phone
ar: الرقم

source: Password
ar: كلمة المرور

# forget_password
source: Did you forgot your password ?
ar: هل نسيت كلمة المرور ؟

source: Reset password
ar: إعادة ضبط كلمة المرور

source: Back
ar: رجوع

# reset_link
source: Please enter your phone number to receive a code to create a new password via phone number
ar: الرجاء إدخال رقم الهاتف الخاص بك لتلقي رمز لإنشاء كلمة مرور جديدة عبر رقم الهاتف

source: Done
ar: تم

source: Resend
ar: إعادة إرسال

source: Select new password
ar: اختيار كلمة سر جديدة

source: New password
ar: كلمة المرور الجديدة

# confirm_password
source: Confirme password
ar: تأكيد كلمة المرور

source: Confirm
ar: تأكيد

# passwordsDoesNotMatch
source: Passwords does not match.try again
ar: كلمة السر غير مطابقة أعد المحاولة

source: Account Confirmation
ar: تأكيد الحساب

# verification_code
source: Please verify your mobile phone number To continue creating your account
ar: سيتم إرسال رمز التحقق في رسالة نصية على رقمك , الرجاء إدخال الرمز لتأكيد حسابك

# receive_code
source: I did not receive the code:
ar: لم أستلم الرمز:

# resend_code
source: Resend the code
ar: إعادة إرسال الرمز

# resend_minute
source: You cannot resend the code for 1 minute
ar: لا يمكنك إعادة طلب إرسال الرمز لمدة 1 دقيقة

# confimSignOut
source: Confirm sign out?
ar: تأكيد تسجيل الخروج؟

source: Sign out
ar: خروج

source: Stay
ar: البقاء

source: Farmy
ar: فارمي

# sureShutDown
source: Will be shut down farmy, Are you sure ?
ar: سيتم إغلاق فارمي ، هل أنت متأكد؟

# error
source: An error occurred, please try again later
ar: حدث خطأ ما, الرجاء المحاولة لاحقا

source: Close
ar: إغلاق

source: Processing
ar: جاري المعالجة

source: Exit
ar: خروج

# new_account
source: Register a new account
ar: تسجيل حساب جديد

# fName
source: Name
ar: الاسم

# lName
source: Last name
ar: الشهرة

# police
source: I agree to the terms and conditions and privacy policy
ar: أوافق على الأحكام والشروط وسياسة الخصوصية

source: Register
ar: تسجيل

source: Welcome :)
ar: أهلاً بك :)

source: Settings
ar: الإعدادات

source: All invoices
ar: جميع الفواتير

source: Connect with us
ar: تواصل معنا

source: Join our team
ar: انضم إلى فريقنا

source: Who are we
ar: من نحن

source: Order Archive
ar: أرشيف الطلبات

source: Sign out
ar: تسجيل الخروج

# final_product_appearance
source: Final product appearance and price may vary depending on weight!
ar: قد يختلف شكل المنتج النهائي و السعر حسب الوزن!

source: Total price without delivery
ar: إجمال السعر دون التوصيل

# total_price_without_delivery_nor_tax
source: Total price without delivery and without tax
ar: إجمال السعر دون التوصيل و الضريبة

source: Total Price Without Delivery With Tax
ar: إجمال السعر دون التوصيل شامل الضريبة

# proceed_to_checkout
source: Check Out
ar: متابعة للدفع

# continue_shopping
source: Shop More
ar: متابعة التسوق

# basket
source: Cart
ar: السلة

source: My order
ar: طلباتي

source: Order
ar: طلبات

source: Order Number
ar: رقم الطلب

source: Address
ar: العنوان

source: Delivery Type
ar: نوع التوصيل

source: Expected Time
ar: الوقت المتوقع

source: Total Price with Delivery
ar: إجمال السعر مع التوصيل

source: Show Order
ar: عرض الطلب

source: Track Order
ar: تتبع الطلب

# edit_Orders
source: Edit Order
ar: تعديل الطلب

source: Edit Information
ar: تعديل

source: Delete Order
ar: حذف الطلب

source: Delivery Address
ar: عنوان التوصيل

source: Choose the Address
ar: اختر العنوان

source: Please select the desired delivery address
ar: يرجى اختيار عنوان التوصيل المطلوب

# map_to_choose_location
source: A map to choose a location
ar: اختر موقع على الخريطة

# add_new_favorite_address
source: Add a new favorite address
ar: إضافة عنوان مفضّل جديد

source: Locating
ar: تحديد

source: Favorite addresses
ar: العناوين المفضلة

# choose_favorite_address
source: Search a favorite address name for yourself, for example(Home)
ar: البحث عن اسم العنوان مفضّل لديك مثال (المنزل)

source: Address details
ar: تفاصيل العنوان

source: Neighborhood
ar: الحي

source: Street
ar: الشارع

# build
source: Building
ar: البناء

source: Entrance number
ar: رقم المدخل

source: Floor
ar: الطابق

source: Other details
ar: تفاصيل أُخرى

source: Adding the address
ar: إضافة العنوان

source: Personal Details
ar: التفاصيل الشخصية

source: Edit Picture
ar: تعديل الصورة

source: Delivery Addresses
ar: عناوين التوصيل

# edit_Addresses
source: Add, Edit, and Delete Delivery Addresses
ar: إضافة و تعديل و حذف عناوين التوصيل

source: Electronic Payment
ar: الدفع الإلكتروني

# payment_Methods
source: Available Electronic Payment Methods
ar: أساليب الدفع الإلكترونية المتوفرة

# rewards_Program
source: Rewards Program 'Hello.
ar: برنامج المكافآت "مرحبا"

source: Redeem Points for Discounts
ar: استبدال النقاط للحصول على حسومات

source: My Reviews
ar: تقييماتي

source: All Reviews
ar: جميع تقييماتي

# name_number
source: The name,last name, mobile number
ar: الاسم, الشهرة, رقم الموبايل

source: Birthday
ar: الميلاد

source: day
ar: يوم

source: Today
ar: اليوم

source: Month
ar: الشهر

source: Year
ar: السنة

# change_Number
source: Change the Number
ar: تغيير الرقم

source: Save Changes
ar: حفظ التغييرات

source: confirmNumber
ar: رمز التأكد من الرقم

# notification
source: Notifications
ar: اشعارات

source: Skip
ar: تخطي

source: Next
ar: متابعة

# onBoarding1
source: Get a shopping experience like no other
ar: احصل على تجربة تسوق لا مثيل لها على الإطلاق!

# onBoarding2
source: Your order is just a few touches away, at the absolute best price
ar: طلبك على بعد لمسات قليلة بالسعر الأفضل على الإطلاق

# onBoarding3
source: Shop more, collect more points... Dozens of gifts are waiting for you :)
ar: تسوق أكثر و أجمع نقاط أكثر.. عشرات الهدايا بانتظارك :)

source: Order Tracking
ar: متابعة الطلب

# delivery_time
source: The expected delivery time for your order is:
ar: الوقت المتوقع لتوصيل طلبك هو :

# your_order_has_received
source: Your order has been received
ar: تم استلام طلبك

source: Your order is being processed
ar: يتم تجهيز طلبك

source: Your order is out for delivery
ar: طلبك قيد التوصيل

source: Track your order on the map
ar: تتبع طلبك على الخريطة

# contact_delivery_driver
source: Contact the delivery driver
ar: اتصل مع عامل التوصيل

source: Protection
ar: الحماية

source: Change Password
ar: تغيير كلمة المرور

source: Change Language
ar: تغيير اللغة

source: Privacy and Terms of Use
ar: الخصوصية و شروط الاستخدام

source: Terms and Conditions
ar: الشروط و الأحكام

source: Privacy Policy
ar: سياسة الخصوصية

source: Frequently Asked Questions
ar: الأسئلة الشائعة

# about_Application
source: About the Application
ar: حول التطبيق

source: Available Electronic Payment Methods
ar: أساليب الدفع الالكترونية المتوفرة

# payment_via_Banks
source: Payment via Banks (Coming Soon)
ar: الدفع عبر البنوك (قريبا)

source: Available Banks for Use
ar: البنوك المتاح استخدامها

# electronic_Payment_Companies
source: Electronic Payment Companies (Coming Soon)
ar: شركات الدفع الالكتروني (قريبا)

source: Available for use companies
ar: الشركات المتاح استخدامها

# farmy_Portfolio
source: Farmy Portfolio (Coming soon)
ar: محفظة فارمي (قريبا)

# farmy_electronic_portfolio
source: Farmy's electronic portfolio
ar: محفظة الكترونية خاصة بفارمي

source: Welcome to Farmy :)
ar: أهلا بك في فارمي :)

# please_choose_delivery_location
source: Please choose a delivery location for a better shopping experience
ar: الرجاء اختيار موقع التوصيل للحصول على تجربة تسوق أفضل

source: Select delivery location
ar: اختيار موقع التوصيل

# skip_stage_now
source: Skip the stage for now
ar: تخطي المرحلة حاليا

source: Show More
ar: رؤية الكل

source: Sections
ar: الأقسام

source: Suggested Products
ar: المنتجات المقترحة

source: Discounts
ar: الحسومات

source: Price
ar: السعر

source: Related Products
ar: منتجات ذات صلة

source: Similar Products
ar: منتجات مشابهة

source: Add to Basket
ar: اضافة الى السلة

source: Payment
ar: الدفع

# cash_payment
source: Cash on delivery
ar: الدفع عند الاستلام

source: Farmy Wallet
ar: محفظة فارمي

# payment_statment
source: The final product form and price may vary based on the weight!
ar: قد يختلف شكل المنتج النهائي و السعر حسب الوزن !

# return_statment
source: Delete the product you want to return to have it removed from the invoice
ar: احذف طلبك الذي تريد ارجاعه ليتم حذفه من الفاتورة

# main_address
source: Main Current Address
ar: العنوان الحالي الرئيسي

# redeem_points
source: Points Exchange
ar: استبدال نقاط

# conduction
source: Delivery
ar: التوصيل

source: Delivery To :
ar: التوصيل إلى:

source: Delivery Cost:
ar: كلفة التوصيل:

# hasm_code
source: Discount
ar: الحسم

source: Additional discount
ar: حسم إضافي

# cannot_use_both_code_points
source: You can't use the discount code and redeem points at the same time
ar: لا يمكنك استخدام الكود الحسم و استبدال النقاط معاً (اختر واحدة فقط)

source: Reviews
ar: ملاحظات

# add_notes
source: Add your notes here...
ar: اضف ملاحظاتك هنا ...

source: Please select an order type
ar: إضافة ملاحظات على طلبك

# invoice
source: Bill
ar: الفاتورة

source: Normal Request
ar: طلب عادي

source: Urgent Request
ar: طلب مستعجل

source: Order Scheduling
ar: جدولة الطلب

source: Total Amount
ar: المبلغ الإجمالي

source: Discount Code
ar: كود الحسم

source: Delivery Charges
ar: رسوم التوصيل

source: Tax
ar: الضريبة

source: Total
ar: الإجمالي

source: Delete Account
ar: حذف الحساب

# sorry_for_delete_account
source: We're sorry to see you leave the application! If you have any issues, we can still assist you.
ar: يؤسفنا مغادرتك التطبيق ! إذا كان لديك مشكلة ما..مازلنا نستطيع مساعدتك

# write_in_this_box_optional
source: Writing in this box is optional
ar: الكتابة في هذا الصندوق اختياري

# please_write_your_phone_and_password
source: Please enter your phone number and password for confirmation
ar: الرجاء كتابة رقمك وكلمة المرور للتأكيد

# password_with_star
source: Password **
ar: كلمة المرور **

source: Confirm Delete
ar: تأكيد الحذف

source: Your account has been successfully deleted
ar: تم حذف حسابك بنجاح

# order_Number_With_dote
source: Order Date :
ar: رقم الطلب :

source: Order Date :
ar: تاريخ الطلب :

source: Site :
ar: الموقع :

source: Delivery Operator Name :
ar: اسم عامل التوصيل :

source: Total Price :
ar: إجمالي السعر :

# order_total_price
source: Total Price
ar: إجمالي السعر

source: Evaluation :
ar: التقييم :

source: All Invoices
ar: جميع الفواتير

source: Products Price :
ar: سعر المنتجات :

source: Price of Returned Products :
ar: سعر المنتجات المرتجعة :

source: Rebates Value :
ar: قيمة الحسومات :

source: Delivery Price :
ar: سعر التوصيل :

source: About The App
ar: حول التطبيق

source: Store
ar: متجر

source: Favorite
ar: المفضلة

source: My Requests
ar: طلباتي

# my_Account
source: Account
ar: حسابي

# all_section
source: All Sections
ar: جميع الاقسام

source: Previous Password
ar: كلمة المرور السابقة

# forgot_Password_Without_question_mark
source: Forgot Password
ar: نسيت كلمة السر

# join_Our_Team_Statment
source: If you want to join the our team, please fill out you Information below, and we will contact you as soon as possible
ar: إذا كنت تريد الانضمام لفريق فارمي, الرجاء تعبئة المعلومات أدناه, وسنتواصل معك في أقرب وقت ممكن

source: Full Name
ar: الاسم الكامل

source: Contact Number
ar: رقم التواصل

source: Choose The Right Job for You
ar: اختار العمل المناسب لك

# leave_message_to_contact
source: Leave us your message here and weâ€™ll contact you as soon as possible.
ar: اترك لنا رسالتك هنا وسيتم التواصل معك تبعاً لطلبك في أقرب وقت.

# email_with_at
source: Email @ ...
ar: الايميل @ ....

# write_message_notes_question_here
source: Write your message, feedback, or inquiry here...
ar: اكتب رسالتك, ملاحظاتك, أو استفسارك هنا ...

# sent
source: Send
ar: إرسال

# you_can_connect_directly
source: You can contact our customer service directly on this number
ar: ويمكنك التواصل مع قسم خدمة العملاء مباشرة على الرقم التالي

source: On the next number
ar: على الرقم التالي

# or_via_whatsup
source: Or via Whatsapp
ar: أو عبر تطبيق Whatsapp

source: Contact Us
ar: تواصل معنا

source: Password Field Is Required.
ar: حقل كلمة المرور مطلوب

# passwordShouldBeEightCharacter
source: Password must have at least 7 characters.
ar: كلمة المرور يجب ان تتكون من 3 محارف على الأقل

source: Please confirm your password.
ar: الرجاء تأكيد كلمة السر

source: E-mail Field Is Required
ar: حقل الأيميل مطلوب

# emailIsNotValid
source: This E-mail is not a Valid Email.
ar: هذا ليس عنوان بريد إلكتروني صالح

# phoneFieldIsRequired
source: Your Phone Field Is Required
ar: حقل رقم الهاتف مطلوب

# wrongPhoneNumber
source: Wrong Phone Number, ex 9********
ar: رقم الهاتف خاطئ, مثال ********9

# fNameFieldIsRequired
source: First Name Field Is Required.
ar: حقل الأسم مطلوب

# lNameFieldIsRequired
source: Last Name Field Is Required.
ar: حقل الشهرة مطلوب

source: Try again
ar: إعادة المحاولة

# no_add_basket
source: Cannot add to cart. Please sign in
ar: لا يمكن اضافة الى السلة الرجاء تسجيل الدخول

source: Please sign in
ar: الرجاء تسجيل الدخول

# welcome_to
source: Welcome to Farmy
ar: أهلاً بك في فارمي

# sign_now_or_create
source: Sign now or create a new account to have a more enjoyable and faster shopping experience :)
ar: سجل الدخول الآن أو أنشئ حساباً جديداً لتحصل على تجربة تسوقأ ممتع و أسرع :)

# requiredChange
source: Change Required (Optional)
ar: الفكة المطلوبة (اختياري)

source: Discount
ar: حسم

# thereIsNoProduct
source: Sorry, there are no products that belong to this category at the moment
ar: عذرا لا يوجد أي منتجات تنتمي لهذه الفئة حاليا

# curruncy
source: SYP
ar: ل.س

# sorryBasketIsEmpty
source: Sorry, currently the basket is empty
ar: عذرا السلة فارغة

# orderSuccesfulyComplete
source: The order has been completed successfully, you can proceed with your order from my order list
ar: تمت الطلبية بنجاح, يمكنك متابعة طلبك من قائمة طلباتي

source: Would you like to confirm your order?
ar: هل ترغب بتأكيد طلبك؟

source: You can proceed with your order after confirmation from my order list
ar: يمكنك متابعة طلبك بعد التأكيد من قائمة طلباتي

source: would you like to remove the selected products from your order ?
ar: هل ترغب بحذف المنجات المختارة من طلبك؟

source: when you remove the selected products the new invoice will be calculated
ar: في حال حذفك للمنتجات سيتم حساب الفاتورة من جديد

source: Locating your position ......
ar: جاري تحديد موقعك ......

# searchForProduct
source: Search Products
ar: البحث عن المنتجات

# thereIsNoSubCategory
source: There is No Sub category Now!
ar: عذرا لا يوجد أي فئات فرعية تنتمي لهذه الفئة حاليا

# thereIsNoCategory
source: There is No Category Now!
ar: عذرا لا يوجد أي فئات حاليا

source: Area
ar: المنطقة

# approve
source: Please approve the terms and conditions.
ar: يرجى الموافقة على الشروط و الاحكام

# validatePasswordMsg2
source: Use 8 characters with at least one uppercase ,one lowercase letter one number and one symbol
ar: استخدم أحرف كبيرة وصغيرة أرقام & رموز

source: Edit
ar: تعديل

# no_order
source: There are not orders
ar: لايوجد طلبات حالياً تسوق الآن, وتتبع طلبك إلى أن يصل لك :)

source: Order details
ar: تفاصيل الطلب

# delete_product
source: The product will be removed from the basket
ar: سوف يتم حذف المنتج من السلة

source: Email option
ar: الإيميل (اختياري)

source: Offers Notifications
ar: إشعارات العروض

source: App Notifications
ar: إشعارات التطبيق

source: Sign Up Now
ar: تسجيل الان

# try_load
source: Try load page
ar: إعادة تحميل الصفحة

source: Cart
ar: السلة

# delete_your_order
source: Delete the order you want to return to have it removed from the invoice
ar: إحذف طلبك الذي تريد ارجاعه ليتم حذفه من الفاتورة

source: Points and Rank
ar: النقاط و الرتبة

source: Activities And Offers
ar: الأنشطة و العروض

source: Points History
ar: تاريخ النقاط

source: Used points
ar: النقاط المستعملة

source: Ended Points
ar: النقاط المنتهية

source: Earned Points
ar: النقاط المكتسبة

source: Date of use
ar: تاريخ الاستعمال :

source: Date of earn
ar: تاريخ الاكتساب :

source: Expiry date:
ar: تاريخ انتهاء صلاحية :

source: point
ar: نقطة

source: points
ar: نقاط

source: Activities
ar: الأنشطة

source: Offers
ar: العروض

# prize
source: The Prize
ar: الجائزة

# copy_code
source: You can copy the code by clicking on it
ar: يمكنك نسخ الكود بالضغط عليه

source: Use only once
ar: يستعمل لمرة واحدة فقط

source: Code validity:
ar: صلاحية الكود :

# code_copied
source: The code has been copied
ar: تم نسخ الكود

source: Discount code
ar: كود حسم

source: Your Rank
ar: رتبتك الان

source: Bronze
ar: برونزي

source: Silver
ar: فضي

source: Gold
ar: ذهبي

source: Platinium
ar: بلاتينيوم

# sp_remaining_to_get_the_next_level
source: Point remaining to get the next level
ar: نقطة متبقية للوصول إلى المستوى التالي

# value_in_syrian_pounds
source: The value of the points
ar: قيمة النقاط

source: Points expire in
ar: تنتهي صلاحية النقاط خلال

source: Rewards Guide
ar: دليل المكافئات

# the_coupon_was_purchased
source: The coupon was purchased successfully
ar: تم شراء الكوبون بنجاج

# levels_and_benefits
source: levels
ar: مستويات العضوية

source: note
ar: ملاحظة:

# all_points_expire_in_period
source: All points expire within a period
ar: تنتهي صلاحية جميع النقاط خلال مدة

# all_points_will_expire_after_period
source: From the date of obtaining them, it will not be possible to exchange the points after the expiration of their validity period.
ar: من تاريخ الحصول عليها و سيكون من غير الممكن استبدال النقاط بعد انتهاء مدة صلاحيتها.

source: Rank Features:
ar: ميزات الرتبة:

source: Congrats :)
ar: مبروك :)

source: You got
ar: لقد حصلت على

source: Loading
ar: يتم التحميل

source: Added to basket
ar: تمت الإضافة إلى السلة

# no_favorite_items
source: There are no favorite items
ar: لا يوجد عناصر مفضلة

# pleaseLogIn
source: Please login to add items to your favorites
ar: الرجاء تسجيل الدخول لاضافة العناصر الى المفضلة

source: Returned
ar: مرتجع

# totalPrice
source: Total price + delivery price + discount
ar: إجمالي السعر + سعر التوصيل + الحسم

# you_cannot_use_the_discount_code
source: You cannot use the discount code and redeem points together (choose one only)
ar: لا يمكنك استخدام كود الحسم واستبدال النقاط معا (اختر واحدة فقط)

source: Minutes
ar: الدقيقة

# minutes_2
source: Minutes
ar: دقيقة

source: Hour
ar: الساعة

source: Select Hour
ar: اختر الساعة

source: Select Calculator
ar: اختر التاريخ

source: Current Requests
ar: الطلبات الجارية

source: Basket not installed
ar: سلة غير مثبتة

# place_orders
source: You can place orders at the time you want to order these baskets
ar: يمكنك تثبيت الطلب في أي وقت ترغب به خلل أوقات الدوام، أو جدولة الطلب إذا كنت ترغب بتثبيت الطلب خارج أوقات الدوام

source: Type of Request
ar: نوع الطلب

source: Number of orders
ar: عدد الطلبات

source: quantity
ar: عدد

# install
source: Confirm Order
ar: تثبيت الطلب

source: Delivery service is available from now on
ar: خدمة التوصيل متوفرة من الساعة

source: in the morning until noon
ar: صباحاً حتى الساعة

source: In the evening, it is possible to choose to order now and have it delivered in the morning
ar: مساءً, من الممكن اختيار الطلب الآن والتوصيل صباحاً

# baskets_are_not_required
source: Draft requests
ar: مسودة الطلبات

source: MyCoupon
ar: كوبوناتي

# all_products
source: All
ar: جميع المنتجات

source: Field is required
ar: الحقل مطلوب

source: Save as draft
ar: حفظ كمسودة

# noResult
source: There are no search results
ar: لا يوجد نتائج بحث

# no_notifications
source: There are no notifications
ar: لا يوجد اشعارات

source: We are now out of business hours
ar: نحن الآن خارج ساعات العمل

# you_cannot_order_now
source: You cannot order now, but you can schedule your order for later or save the order in drafts
ar: لا يمكنك الطلب الآن, ولكن يمكنك جدولة طلبك لوقت لاحق أو حفظ الطلب في المسودات

source: More Details
ar: تفاصيل إضافية

source: The location must be marked on the map
ar: يجب تحديد الموقع على الخريطة

source: Pleas Selected Marker
ar: الرجاء تحديد موقع

source: Hi
ar: مرحباً

source: Favorite Address
ar: العناوين المفضّلة

source: View basket
ar: عرض السلة

source: Download pdf
ar: تنزيل pdf

source: Save edits
ar: حفظ التعديلات

# order_delivered_successfully
source: Your order has been delivered
ar: تم تسليم طلبك

# thanks_for_shopping_in_farmy
source: Thank you for shopping with Farmi
ar: شكرا لتسوقك مع فارمي

# rate_order_and_get_points
source: Rate the order now and get extra points
ar: قم بتقييم الطلب الآن وأحصل على نقاط إضافية

# what_do_you_think_to_get_better_experience
source: What do you think needs improvement for a better experience?
ar: ما الذي يحتاج برأيك إلى تحسين للحصول على تجربة أفضل؟

# address_add
source: Address has been added
ar: تم اضافة العنوان

# delete_site
source: Do you want to delete the site?
ar: هل تريد حذف الموقع؟

source: please choose your location
ar: يرجى اختيار موقعك

# store_is_closed
source: The store is closed. You can schedule an order or place an order during working hours
ar: المتجر مغلق، يمكنك جدولة الطلب أو تثبيت الطلب ضمن أوقات الدوام

# add_product
source: Add products
ar: اضافة منتجات

source: View draft items
ar: عرض عناصر المسودة

source: View Code
ar: عرض كود تأكيد الطلب

source: Order Verify Code
ar: رمز التحقق من الطلب

# order_verify_code_desc
source: Please provide the delivery man with the code Complete implementation
ar: يرجى تزويد عامل التوصيل بالرمز لإتمام عملية التوصيل

source: Rate order
ar: قيّم الطلب
